Revit 2024 API
Rebar.NumberOfBarPositions Property
 The number of potential bars in the set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2009
Syntax
C#
public int NumberOfBarPositions { get; set; }
Visual Basic
Public Property NumberOfBarPositions As Integer
	Get
	Set
Visual C++
public:
property int NumberOfBarPositions {
	int get ();
	void set (int value);
}
Remarks
 The number of positions is equal to the number of actual bars (the Quantity), plus the number of bars that are excluded.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: the number of bar positions numberOfBarPositions is less than 1 or more than 1002.
Autodesk.Revit.Exceptions.InapplicableDataException |  When setting this property: This rebar element represents a single bar (the layout rule is Single).
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace